OpenFOAM_FluidMechanics/Pitching_Airfoil/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    aerofoil
    {
        type            zeroGradient;
    }
    inlet
    {
        type            zeroGradient;
    }
    outlet 
    {
        type            fixedValue;
        value           uniform 0;
    }
    
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
